{
    "case_0": {
        "description": "El caso 0 es el caso hecho para la actividad del dia 28 de septiembre de 2024.",
        "type": "clasificación",
        "inputs": "2 entradas de tipo numerico (A y B) las cuales tienen un valor entre 0 y 1.",
        "outputs": "1 salida de tipo numerico (C) la cual tiene 3 posibles valores: 0, 1 y -1.",
        "number_of_patterns": "10",
        "requirements": "No hay requerimientos especiales para este caso.",
        "example": "Resources/example_case_0.png"
    },
    "case_1": {
        "description": "El caso 1 es el caso hecho para la actividad del dia 5 de octubre de 2024. consiste en un problema de datos binarios en las entradas y en las salidas.",
        "type": "clasificación",
        "inputs": "4 entradas de tipo binario las cuales tienen 2 posibles valores 0 y 1.",
        "outputs": "1 salida de tipo binario la cual tiene 2 posibles valores: 0 y 1.",
        "number_of_patterns": "16",
        "requirements": "Poner de forma personalizada el valor de alpha (α) y el valor de beta (β).",
        "example": "Resources/example_case_1.png"
    },
    "case_2": {
        "description": "El caso 2 es el caso hecho para la actividad del dia 5 de octubre de 2024. consiste en la clasificación o predicción del resultado en la ecuación Sen(a) + Cos(b) + c = Y.",
        "type": "Clasificación",
        "inputs": "3 entradas (A,B,C) de tipo numerico, donde A y B tienen valores en el rango de 0 y 2π mientras que C tiene un valor entre -1 y 1.",
        "outputs": "1 salida de tipo numerico resultado de la ecuación Sen(a) + Cos(b) + c = Y.",
        "number_of_patterns": "100",
        "requirements": "Deben haber minimo 100 patrones de entrenamiento generados aleatoriamente.",
        "example": "Resources/example_case_2.png"
    },
    "case_3": {
        "description": "El caso 3 es el caso hecho para la actividad del dia 5 de octubre de 2024. consiste en la predicción de una lotería",
        "type": "Clasificación o Predicción",
        "inputs": "5 entradas (Dia,Mes,A,B,C) de tipo numerico, donde Dia y Mes tienen valores en el rango normal para un dia y un mes, mientras que A,B y C tiene un valor entre 0 y 9.",
        "outputs": "10 salidas con 3 posibles valores 0, 0.5 y 1.",
        "number_of_patterns": "20",
        "requirements": "Realizar pruebas con 10 datos extras que sean aleatorios para medir el error.",
        "example": "Resources/example_case_3.png"
    },
    "case_4": {
        "description": "El caso 4 es el caso hecho para la actividad del dia 5 de octubre de 2024. consiste en la clasificación de 5 letras de 35 entradas (7 * 5) y 1 salida(Letra).",
        "type": "Clasificación",
        "inputs": "35 entradas de tipo binario las cuales tienen 2 posibles valores 0 y 1.",
        "outputs": "1 salida de tipo numerico la cual tiene 5 posibles valores: 65, 69, 73, 79 y 85.",
        "number_of_patterns": "5",
        "requirements": "No hay requerimientos especiales para este caso.",
        "example": "Resources/example_case_4.png"
    }

}